app/controllers/items_controller.rb

SELECT * FROM "users" WHERE ("users"."id" = 1) LIMIT 1
SELECT * FROM "items"
---
  def index
    @users = User.find(:all)
    @user = current_user

    if params[:type]
      @type = Type.find_by_name(params[:type])
      @items = Item.find_all_by_type_id(@type, :order => "date DESC")
    else
      @items = Item.all(:order => "date DESC")

SELECT * FROM "items" WHERE ("items"."id" = 1)
---
  def show
    @item = Item.find(params[:id])

SELECT * FROM "items" WHERE ("items"."id" = 1)
---
  def edit
    @item = Item.find(params[:id])

INSERT INTO "items" ("updated_at", "title", "date", "type", "amount", "note", "user_id", "created_at") VALUES('2009-01-10 15:18:03', 'Thing', '2009-01-10', NULL, 32446, 'Ok, so, how about this?', 1, '2009-01-10 15:18:03')
---
  def create

    if params[:item][:type_id].split("_")[0] == "0" then
      params[:item][:given_to_id] = params[:item][:type_id].split("_")[1]
      params[:item][:type_id] = nil
    end

    @item = Item.new(params[:item])
    @item.user_id = current_user.id

    respond_to do |format|
      if @item.save

SELECT * FROM "items" WHERE ("items"."id" = 1)
UPDATE "items" SET "updated_at" = '2009-01-08 18:15:02', "user_id" = 0 WHERE "id" = 1
---
  def update
    @item = Item.find(params[:id])

    respond_to do |format|
      if @item.update_attributes(params[:item])

SELECT * FROM "items" WHERE ("items"."id" = 3)
DELETE FROM "items" WHERE "id" = 3
---
  def destroy
    @item = Item.find(params[:id])
    @item.destroy