app/controllers/users_controller.rb

INSERT INTO "users" ("salt", "updated_at", "crypted_password", "remember_token_expires_at", "remember_token", "login", "email", "created_at") VALUES('6ede7a16fda8dce7b9d5efe3b04625048e7a0109', '2009-01-05 17:05:39', '742d8fa826873536a5d0e52d790ffbf46c78a314', NULL, NULL, 'michael', 'michael.amygdalidis@gmail.com', '2009-01-05 17:05:39')
---
  def create
    @user = User.new(params[:user])
    if @user.save